# What kind of data does pandas handle?
##### pandasëŠ” ì–´ë–¤ ì¢…ë¥˜ì˜ ë°ì´í„°ë¥¼ ì²˜ë¦¬í•˜ëŠ”ê°€?

In [1]:
# íŒ¨í‚¤ì§€ ë¡œë“œ
# pandasì˜ ê²½ìš° ëŒ€ë¶€ë¶„ ê´€í–‰ì ìœ¼ë¡œ pd ë¼ëŠ” ë³„ì¹­ìœ¼ë¡œ ë¡œë“œí•¨
import pandas as pd

## pandas data table representation
##### pandas ë°ì´í„°í…Œì´ë¸” í‘œí˜„
![DataFrame](https://pandas.pydata.org/pandas-docs/stable/_images/01_table_dataframe.svg)

In [3]:
# íƒ€ì´íƒ€ë‹‰ ìŠ¹ê° ë°ì´í„° ì €ì¥
# ë°ì´í„°ë‚´ìš©: ì´ë¦„(characters), ë‚˜ì´(integers), ì„±ë³„(male/female)
# ìˆ˜ë™ìœ¼ë¡œ DataFrame ìƒì„± ì‹œ, ë”•ì…”ë„ˆë¦¬ë¥¼ ì‚¬ìš©í•˜ë©´ í‚¤ëŠ” ì—´ ì´ë¦„, ê°’ì€ ì—´ë¡œ ì €ì¥ë¨
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

In [4]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

`DataFrame`
- ë¬¸ì, ì •ìˆ˜, ì†Œìˆ˜, ë²”ì£¼í˜•ë°ì´í„° ë“± ë‹¤ì–‘í•œ ìœ í˜•ì˜ ë°ì´í„°ë¥¼ ì €ì¥í•  ìˆ˜ ìˆëŠ” 2ì°¨ì› ë°ì´í„°êµ¬ì¡°
- SQL: í…Œì´ë¸” / R: ìŠ¤í”„ë ˆë“œ ì‹œíŠ¸, Data.frameê³¼ ìœ ì‚¬

    `df`
    - 3ê°œì˜ ì—´(columns)ë¡œ êµ¬ì„±
    - ì—´ ì´ë¦„ ë° ë°ì´í„° í˜•íƒœ: Name(text), Age(numbers), Sex(text)

## Each column in a DataFrame is a <span style='color:#BF4545'>Series</span>
##### ë°ì´í„°í”„ë ˆì„ì˜ ê° ì—´ì€ ì‹œë¦¬ì¦ˆ
![series](https://pandas.pydata.org/pandas-docs/stable/_images/01_table_series.svg)

In [6]:
# ì—´ ì„ íƒë°©ë²•: ëŒ€ê´„í˜¸[] ì‚¬ì´ì— ì—´ ì´ë¦„ ì…ë ¥(ëŒ€ì†Œë¬¸ì êµ¬ë¶„) - ğŸ·ï¸ ë”•ì…”ë„ˆë¦¬ì—ì„œ í‚¤ë¡œ ê°’ì„ ì„ íƒí•˜ëŠ” ê²ƒê³¼ ìœ ì‚¬
# DataFrame ë‹¨ì¼ ì—´ì€ pandas series íƒ€ì…
df['Age']

0    22
1    35
2    58
Name: Age, dtype: int64

In [8]:
# Series ì²˜ìŒë¶€í„° ë§Œë“¤ê¸°
# SeriesëŠ” ë‹¨ì¼ ì—´ êµ¬ì¡°ë¼ ì—´ ì´ë¦„ì´ ì—†ìŒ(í–‰ ì´ë¦„ì€ ìˆìŒ)
ages = pd.Series([22, 35, 58], name = "Age")
ages

0    22
1    35
2    58
Name: Age, dtype: int64

## Do something with a DataFrame or Series
##### ë°ì´í„°í”„ë ˆì„ / ì‹œë¦¬ì¦ˆë¡œ ì‘ì—… ìˆ˜í–‰

In [11]:
# ìŠ¹ê° ìµœëŒ€ ì—°ë ¹ ì•Œì•„ë³´ê¸°
# ë°ì´í„°í”„ë ˆì„ì—ì„œ > ì—°ë ¹(Age) ì—´ ì„ íƒ > ìµœëŒ“ê°’ í•¨ìˆ˜(max) ì ìš©
df['Age'].max()

58

In [12]:
# ì‹œë¦¬ì¦ˆì—ì„œ > ìµœëŒ“ê°’ í•¨ìˆ˜(max) ì ìš©
# max ì™¸ì— ë‹¤ì–‘í•œ 'í•¨ìˆ˜' ì ìš© ê°€ëŠ¥, í•¨ìˆ˜ì´ë¯€ë¡œ ë’¤ì— ê´„í˜¸ ì‚¬ìš©
ages.max()

58

In [13]:
# ìˆ«ì ë°ì´í„° ê¸°ë³¸ í†µê³„ ì•Œì•„ë³´ê¸°
# describe()
## ìˆ«ì ë°ì´í„° ê°œìš”, ì†ì„± ê¸°ë³¸ê°’ì€ ìˆ«ìë°ì´í„°ë§Œ ì²˜ë¦¬(Name, Sex : ë¬¸ìë°ì´í„°) > DataFrame / Series íƒ€ì…ìœ¼ë¡œ ë°˜í™˜
## seriesì—ë„ ì ìš© ê°€ëŠ¥
## í†µê³„ì— ì‚¬ìš©ëœ ì§‘ê³„ë°©ë²• ëŒ€í•œ ìƒì„¸ ì •ë³´ëŠ” ìœ ì € ê°€ì´ë“œ : describe ì°¸ê³ 
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

## summary

1. íŒ¨í‚¤ì§€ ë¡œë“œ : `import pandas as pd`
2. ë°ì´í„° í…Œì´ë¸”ì€ pandas `DataFrame` ìœ¼ë¡œ ì €ì¥ë¨
3. ë°ì´í„°í”„ë ˆì„ì˜ ê° ì—´ì€ `Series` íƒ€ì…ì„
4. ë°ì´í„°í”„ë ˆì„ì´ë‚˜ ì‹œë¦¬ì¦ˆì— ë©”ì„œë“œ ì ìš© ê°€ëŠ¥

# How do I read and write tabular data?
##### í…Œì´ë¸” ë°ì´í„° ì½ê³  ì“°ëŠ” ë²•
![table_rw](https://pandas.pydata.org/pandas-docs/stable/_images/02_io_readwrite.svg)

In [3]:
# íƒ€ì´íƒ€ë‹‰ ìŠ¹ê° ë°ì´í„°(csv) ë¶ˆëŸ¬ì˜¤ê¸°
# read_csv('src') | read_ë°ì´í„°íƒ€ì…(csv, xls, parquet â€¦) ìœ¼ë¡œ ë°ì´í„° ë¡œë“œ
# ë°ì´í„° ë¡œë“œ í›„ í™•ì¸ ìŠµê´€í™”í•˜ê¸°(ê¸°ë³¸ê°’ ì•ë’¤ 5í–‰ì”© ë³´ì—¬ì¤Œ)
titanic = pd.read_csv('data/titanic.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
# ì¼ë¶€ë°ì´í„° ë¶ˆëŸ¬ì˜¤ê¸° : head(n) | tail(n)
titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [5]:
# ì—´ ë°ì´í„° ì†ì„± í™•ì¸ : dtypes(ì†Œê´€í˜¸ ì‚¬ìš© ì•ˆí•¨ ì£¼ì˜ > DataFrame, Seriesì˜ 'ì†ì„±'ì´ê¸° ë•Œë¬¸)
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
# ë°ì´í„° ìŠ¤í”„ë ˆë“œì‹œíŠ¸ í˜•íƒœë¡œ ë‚´ë³´ë‚´ê¸°
# to_excel('file name.type') | to_* ë°ì´í„° ì €ì¥ 
# sheet_name : ì‹œíŠ¸ëª… ì§€ì • ì†ì„±, index : false ì„¤ì •ì‹œ í–‰ ì¸ë±ìŠ¤ ì €ì¥ ì•ˆí•¨
titanic.to_excel('titanic.xlsx', sheet_name = 'passengers', index = False)

In [8]:
pd.read_excel('titanic.xlsx')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [10]:
# ë°ì´í„°í”„ë ˆì„ ìš”ì•½
# info() : í•´ë‹¹ ê°ì²´ í´ë˜ìŠ¤, í¬ê¸°, ì¸ë±ìŠ¤ ë²”ìœ„, ì—´ ê°œìˆ˜, ì—´ë³„ ê°’ ê°œìˆ˜ ë° null ê°œìˆ˜, ì—´ë³„ ê°’ íƒ€ì…(str, object/ integer / float), ì‚¬ìš© ë¨ ìš©ëŸ‰
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## summary
1. `read_*` ë©”ì„œë“œë¡œ ë‹¤ì–‘í•œ ë°ì´í„°í˜•ì‹ ë¶ˆëŸ¬ì˜¤ê¸°
2. `to_*` ë©”ì„œë“œë¡œ ë‹¤ì–‘í•œ ë°ì´í„°í˜•ì‹ ë‚´ë³´ë‚´ê¸°
3. `head()`, `tail()`, `info()` ë©”ì„œë“œì™€ `dtypes` ì†ì„±ìœ¼ë¡œ ë°ì´í„° ì²« í™•ì¸ ìŠµê´€í™”í•˜ê¸°